task_1/Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Товары</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

task_1/AccumulationRegisters/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>Товары</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

task_1/Documents/РасходнаяНакладная/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)  
	#Область ЗапросНоменклатурыИзДокумента
	Запрос = Новый Запрос;          
	МенеджерВТ = Новый МенеджерВременныхТаблиц;  
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;    
	
		Запрос.Текст = "ВЫБРАТЬ
	                |	ПродажаТовараНоменклатура.Номенклатура КАК Номенклатура,
	                |	СУММА(ПродажаТовараНоменклатура.Количество) КАК Количество
	                |ПОМЕСТИТЬ НоменклатураДокумента
	                |ИЗ
	                |	Документ.РасходнаяНакладная.Номенклатура КАК ПродажаТовараНоменклатура
	                |ГДЕ
	                |	ПродажаТовараНоменклатура.Ссылка = &Ссылка
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ПродажаТовараНоменклатура.Номенклатура
	                |
	                |ИНДЕКСИРОВАТЬ ПО
	                |	Номенклатура
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	НоменклатураДокумента.Номенклатура КАК Номенклатура,
	                |	НоменклатураДокумента.Количество КАК Количество
	                |ИЗ
	                |	НоменклатураДокумента КАК НоменклатураДокумента";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
      РезультатЗапроса = Запрос.Выполнить(); 
	#КонецОбласти
	
	#Область ЗаписьВРегистр
	ВыборкаТовары = РезультатЗапроса.Выбрать(); 
	Пока ВыборкаТовары.Следующий() Цикл       
		Движение = Движения.Товары.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаТовары.Номенклатура;
		Движение.Количество = ВыборкаТовары.Количество;
	КонецЦикла;                                                      

	Движения.Товары.Записать();       
	#КонецОбласти
	
      #Область КонтрольОстатков	
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
		Запрос = Новый Запрос; 
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.Текст = 
				  "ВЫБРАТЬ
				  |	ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
				  |	ТоварыОстатки.Номенклатура.Представление КАК НоменклатураПредставление,
				  |	ТоварыОстатки.Номенклатура КАК Номенклатура
				  |ИЗ
				  |	РегистрНакопления.Товары.Остатки(
				  |			&МоментВремени,
				  |			Номенклатура В
				  |				(ВЫБРАТЬ
				  |					НоменклатураДокумента.Номенклатура
				  |				ИЗ
				  |					НоменклатураДокумента)) КАК ТоварыОстатки
				  |ГДЕ
				  |	ТоварыОстатки.КоличествоОстаток < 0";
		
		   ГраницаКонтроля = Новый Граница(МоментВремени(), ВидГраницы.Включая);
		   Запрос.УстановитьПараметр("МоментВремени", ГраницаКонтроля);

		   РезультатЗапросаНехваткаТоваров = Запрос.Выполнить(); 
		   ВыборкаДетальныеЗаписи = РезультатЗапросаНехваткаТоваров.Выбрать();
		   
		   Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Не хватает товара: " + Строка(ВыборкаДетальныеЗаписи.НоменклатураПредставление) + 
				" " + Строка(-ВыборкаДетальныеЗаписи.КоличествоОстаток) +
				" единиц.";
				Сообщение.Сообщить();
				Отказ = Истина;
		  КонецЦикла;        
			
	КонецЕсли;
		
      #КонецОбласти
	  
КонецПроцедуры
